// Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5

Console.Write("Введите число: ");
string a = Console.ReadLine();

 Console.WriteLine(a.Length);


// Да, да тут наверное надо было через цикл делить число, но операция вычисления заняла бы больше времени и памяти на выполнение.